{
    "_comment": "总共37个条目,爬取了3月,用时4.2分钟,爬取时间(2025-04-26)",
    "https://www.tiktok.com/@tiffintech/video/7487972819419057413": {
        "pub_time": "3-31",
        "desc": "Ever wonder where AI learns to create? While most models scrape billions of images without permission,@adobefirefly is changing the game! It's the only commercially safe AI video model that uses licensed content and compensates creators. \n\nThe difference matters for three big reasons: First, creators deserve control over their work. Second, content from scraped data exists in a legal gray area that's risky for commercial use. Third, this approach actually delivers higher quality results—proving that ethical constraints drive innovation rather than limit it. \n\nAdobe Firefly's curated datasets produce more precise outputs with improved coherence and fidelity. Better ethics, better quality, better results.\n\nCheck out firefly.adobe.com and join the responsible AI movement! #AdobePartner"
    },
    "https://www.tiktok.com/@tiffintech/video/7487236777367964933": {
        "pub_time": "3-29",
        "desc": "Sometimes the older technology outperforms some of the newer things. What else would you say this is the case for? \n\n#tech #technology #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7486667657844903223": {
        "pub_time": "3-28",
        "desc": "And you’re telling me this is the worst Ai will ever be?!"
    },
    "https://www.tiktok.com/@tiffintech/video/7486609947472497975": {
        "pub_time": "3-28",
        "desc": "Too niche? Why do I put off going for fresh air way too late in the day 😅"
    },
    "https://www.tiktok.com/@tiffintech/video/7486581800207322423": {
        "pub_time": "3-28",
        "desc": "Have you ever noticed you don’t quite look the same in photos as you do in the mirror?\n\nThe reason isn’t just lighting… it’s AI. Your phone camera isn't capturing reality; it's quietly reshaping it.\n\nLook closely. Every time you snap a picture, powerful AI algorithms instantly analyze what’s in\nthe frame. They detect faces, objects, and environments, then automatically tweak things to look “better”. \n\n#tech #technology #stem #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7486524139692363013": {
        "pub_time": "3-28",
        "desc": "What happens when a robot doesn’t know what to do?\n\nNo script. No instructions. Just a task — and it has to figure it out.\n\nBut here’s the catch: In the real world, failure isn’t free. A bad decision can break something —\nor someone could get hurt.\nSo how do we make robots that learn safely?\n\nReinforcement learning lets a robot explore. Try something. Get a reward if it works, a penalty if\nit doesn’t. Over time, it builds a policy — its internal guide for what to do next.\n\nBut not all robots learn this way.\nSome copy humans — that’s imitation learning. Others follow strict rules. The best systems blend all three.\n\nA delivery robot, for example, might use physics to stay upright, imitation to handle crowds, and\nreinforcement learning to react to surprises.\n\nTo make that safe, we start with sim-to-real transfer — the robot trains in simulation first.\n\nThen we use human-in-the-loop learning — people guide and reinforce good behavior.\n\nAnd we add safety constraints — hard-coded limits on force, speed, and movement.\n\nSo yeah — robots are learning. Just like we do. A little messy. A lot of math. And one mistake at\na time. And that’s what makes it exciting.\n\n#tech #robotics #stem #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7486216486986468663": {
        "pub_time": "3-27",
        "desc": "Is it worth learning to code in 2025? Here is how I would go about it differently if I was to start all over again. \n\n#tech #technology #stem #coding"
    },
    "https://www.tiktok.com/@tiffintech/video/7486185134568312069": {
        "pub_time": "3-27",
        "desc": "Let’s build a machine learning model to make predictions about F1s upcoming Japan GP. \n\nThe model has three key components:\n\t1.\tA Linear Regression model trained on historical qualifying lap data — it finds a line through the data that helps us predict future values\n\t2.\tA performance factor system to capture unique team and driver strengths\n\t3.\tA robust data preprocessing pipeline to handle missing data effectively \n\nOur model uses Q1 and Q2 lap times as input features to predict Q3 times. It learns correlations such as Q1 to Q3, Q2 to Q3, team performance trends, and driver consistency.\n\nWe then can enhance these ML predictions by integrating domain-specific multipliers:\n\t•\tTeam factors (text in screen: e.g., Red Bull at 0.997, offering a 0.3-second advantage)\n\t•\tDriver factors (text on screen: e.g., Max Verstappen at 0.998, providing a 0.2-second advantage)\n\t•\tConsiderations for track evolution over the session\n\nGitHub link is GitHub.com/tiffintech/f1_predictions \n\n#tech #ai #ml #codewithme #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7485915457053019398": {
        "pub_time": "3-26",
        "desc": "What is the difference between docker and a virtual machine?! Here is a simple explanation so you never forget it 💡\n\n#tech #technology #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7485891738016419078": {
        "pub_time": "3-26",
        "desc": "What is the difference between serverless computing and containers like Docker?! Here is a simple explanation so you never forget it 💡\n\n#tech #techexplained #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7485502300518092037": {
        "pub_time": "3-25",
        "desc": "I found this survey pretty interesting on how software engineers actually use AI and thoughts on it. What are your thoughts?? \n\n#tech #stem #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7485387576614948101": {
        "pub_time": "3-24",
        "desc": "These numbers surrounding AI are huge 🤯\n\n$235 billion. That’s how much companies spent on AI in 2024, with projections reaching $600 billion by 2028. But here’s the catch: Less than half are seeing real returns. Why? Because AI isn’t making our work easier - yet..\n\nThat’s where agentic AI comes in - AI that doesn’t just assist, but acts. \n\nTake the @Lenovo Hybrid AI Advantage, for example. It not only enables Hybrid AI across organizations but also provides customers with agentic AI use cases to turn AI investments into real outcomes faster. From automating creative workflows to analyzing 1000-page contracts in seconds, Lenovo is helping organizations extract real value from AI faster. Which is a win-win for all of us! \n\n#LenovoPartner"
    },
    "https://www.tiktok.com/@tiffintech/video/7484650699997940997": {
        "pub_time": "3-22",
        "desc": "Some of my favorite robots from NVIDIAs GTC #tech #ai #robotics"
    },
    "https://www.tiktok.com/@tiffintech/video/7484459687472106807": {
        "pub_time": "3-22",
        "desc": "How do you fix the internet at the bottom of the ocean?! \n\nThe internet crosses oceans… through cables on the seafloor.\n\nBut some are only as think as a Sharpie — yet carry 99% of global internet traffic.\n\n#tech #technology #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7484114259752783110": {
        "pub_time": "3-21",
        "desc": "Why does google maps never get you lost?! \n\nOkay… rarely 😅\n\n#tech #technology #techexplained"
    },
    "https://www.tiktok.com/@tiffintech/video/7484025545290812677": {
        "pub_time": "3-21",
        "desc": "Or at least helping me 💻 #tech #ai #coding #developer"
    },
    "https://www.tiktok.com/@tiffintech/video/7484016192345165111": {
        "pub_time": "3-21",
        "desc": "What a wild 7 months it’s been and we’re just getting started 🤩🤖 #tech #robotics #ai #ml #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7481795123978849542": {
        "pub_time": "3-15",
        "desc": "Some of the bigggest news in robotics this week. The last one would be so good for deliveries! \n\n#tech #robotics #stem #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7481298927958985989": {
        "pub_time": "3-13",
        "desc": "Is this the most inefficient technology in your home?🤔\n\n#tech #technology #stem #techexplained"
    },
    "https://www.tiktok.com/@tiffintech/video/7481054196750404919": {
        "pub_time": "3-13",
        "desc": "Are you team dark mode or light mode on your devices? #tech #ai #stem #developer"
    },
    "https://www.tiktok.com/@tiffintech/video/7481020645590027526": {
        "pub_time": "3-13",
        "desc": "What is the difference between ANI (artificial narrow intelligence), AGI (artificial general intelligence) and ASI (artificial super intelligence)? Here is a simple breakdown so you never forget it. \n\n#tech #technology #stem #coding #developer #techexplained"
    },
    "https://www.tiktok.com/@tiffintech/video/7480658670141869317": {
        "pub_time": "3-12",
        "desc": "What is the difference between SQL and NoSQL? Here is a simple breakdown so you never forget it. \n\n#tech #technology #stem #techexplained"
    },
    "https://www.tiktok.com/@tiffintech/video/7479959554445298949": {
        "pub_time": "3-10",
        "desc": "What exactly is a container? Explained in simple terms so you never forget it during an interview or meeting 💡\n\n#tech #techexplained #techexpert"
    },
    "https://www.tiktok.com/@tiffintech/video/7479849456653946167": {
        "pub_time": "3-10",
        "desc": "How can you tell if a public wifi is secure (or at least a bit more safe)? \n\n#tech #technology #stem #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7479211719957449990": {
        "pub_time": "3-8",
        "desc": "These robots are getting goooood 🤩 here are some big updates in the robotics world. \n\n#robotics #tech #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7479134979243429126": {
        "pub_time": "3-8",
        "desc": "What is Manus and why is this such a big deal?! \n\nFirst video clip is from Evolving AI IG!\n#tech #technology #coding #stem #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7478871140304178438": {
        "pub_time": "3-7",
        "desc": "What if I told you that Spotify is\nactually counting on you to skip songs - and it might be their most valuable data point?\n\n#tech #technology #futuretech #ai #stem #stemtok"
    },
    "https://www.tiktok.com/@tiffintech/video/7478812123842235654": {
        "pub_time": "3-7",
        "desc": "Every time you swipe on your phone, you're falling for a psychological trick invented before the internet even existed. \n\nTech companies didn't design touchscreens around our needs - they exploited research that mapped exactly how our brains and fingers work.\n\nHeres how it works.. Back in 1954, long before computers were in every home, psychologist\n\nPaul Fitts made a discovery that would change everything about how we interact with technology today. He figured out exactly how our fingers work—specifically, the precise relationship between movement speed and accuracy when tapping targets of different sizes.\n\nThis became Fitts' Law—and here’s the wild part: The reason buttons on your iPhone are around 9-10mm wide isn’t some Apple innovation. It’s because those 1950s experiments proved that’s the ideal size for human fingertips.\n\n#tech #technology #stem #futuretech #techinnovation"
    },
    "https://www.tiktok.com/@tiffintech/video/7478344694435499319": {
        "pub_time": "3-5",
        "desc": "This is MINDBLOWING 🤯 \n\nScientists are working on the fourth dimension for 4D printing, which is time. These materials can actually transform themselves AFTER being printed—changing shape, properties, or function in response to triggers like temperature or moisture.\n\n#tech #technology #stem #futuretech"
    },
    "https://www.tiktok.com/@tiffintech/video/7478134758380293431": {
        "pub_time": "3-5",
        "desc": "What is the difference between machine learning and deep learning? Here is a simple breakdown! \n\n#tech #ai #technology"
    },
    "https://www.tiktok.com/@tiffintech/video/7478125870272630021": {
        "pub_time": "3-5",
        "desc": "So here's a weird thing – we all use the internet every day, but have you ever wondered who actually runs it? Its actually more complicated than you probably realize.\n\n#tech #technology #internet #ai"
    },
    "https://www.tiktok.com/@tiffintech/video/7478094506093497606": {
        "pub_time": "3-5",
        "desc": "Here's something wild—every time you do anything online, your data travels the internet in tiny fragments called packets. But did you know that someone might be looking inside those packets? It’s called Deep Packet Inspection, or DPI, and it’s like X-ray vision for your internet traffic.\n\nSo how does it work? Normally, internet routers just look at packet headers—essentially the digital envelope that says where data is going. But with DPI, network operators peek inside the envelope, examining the actual contents.\n\nISPs use it to manage network traffic, cybersecurity systems use it to detect malware, and some governments use it for surveillance or censorship.\n\n#tech #technology #coding #stem #futuretech"
    },
    "https://www.tiktok.com/@tiffintech/video/7476980848156331270": {
        "pub_time": "3-2",
        "desc": "What if I told you the internet has a trust problem? Right now, when you check your bank account, your data travels through networks that mostly… trust each other. Limited verification, and often, no security checks at all.\n\nThe Border Gateway Protocol, is like the internet’s GPS. But unlike your phone’s GPS, this 1980s system lacks built-in security. When a network says, “Send your Amazon traffic through me!”—other networks often just believe it.\n\nIn 2022 alone, researchers spotted over 10,000 suspicious routing incidents. A famouns incident is when hackers hijacked Amazon’s Route 53 service, redirected users to a fake site, and stole $150,000 in cryptocurrency.\n\nSo why isn’t this fixed? \n\n#tech #technology #stem #futuretech"
    },
    "https://www.tiktok.com/@tiffintech/video/7476664818494082359": {
        "pub_time": "3-1",
        "desc": "What do you think of the results??\n\nThis is a super simplified version of an AI agent and there is a lot left to implement. Here are some notes…\n\nThis is a very basic AI agent because:\n- It only learns from immediate rewards (no long-term strategy)\n- Has limited memory (only last 5 moves)\n- Uses a simple neural network architecture\n\nFor a more advanced AI agent.. next steps to implement.. \n- Deep Q-learning\n- Pattern recognition across multiple games\n- Strategic planning multiple moves ahead\n- Understanding of game theory\n- Ability to adapt to different player styles\n\n#tech #technology #coding #stem #aiagent"
    },
    "https://www.tiktok.com/@tiffintech/video/7476563798225194295": {
        "pub_time": "3-1",
        "desc": "Who else remembers only relying on Stackoverflow?! In all seriousness AI is here to help you learn and do so in a way that is customized to YOU! If I was to learn how to code all over again I 100% would use it! And I do use it every single day! \n\n#ai #tech #coding #stem"
    },
    "https://www.tiktok.com/@tiffintech/video/7476521103557528837": {
        "pub_time": "3-1",
        "desc": "Do you really need to switch your phone to airplane mode during a flight?! \n\n#tech #technology #stem #techexplained"
    },
    "https://www.tiktok.com/@tiffintech/video/7476112710887820599": {
        "pub_time": "2-27",
        "desc": "Let's break down common AI concepts using art history created with @adobefirefly Generate Video! 🎨\n\nFrom RAG systems as ancient hieroglyphics to supervised learning as Renaissance art, and unsupervised learning as Impressionist masterpieces - I'm showing you how AI works through the lens of art history. Each visualization was brought to life using Generate Video, where you can transform your ideas into dynamic videos in seconds.\n\n✨ What makes Firefly special?\n\n- Create commercially-safe AI videos\n- Access exclusively licensed content\n- Support Adobe Stock contributors\n- Generate custom animations\n- Transform still images into video\n- Add dynamic motion to your stories\n\nHead to the link in bio to start creating your own AI-powered videos!\n\n#AdobePartner"
    }
}